# Pandas for Data Scientists

Let us begin by importing those packages that we will need for our program

In [71]:
import pandas as pd
import numpy as np

### Open government data analysis example using Pandas

To illustrate how we can use Pandas in a simple real problem, we will start doing some basic analysis of government data. For the sake of transparency, data produced by government entities must be open, meaning that they can be freely used, reused and distributed by anyone. An example of this is the **Eurostat**, which is the home of European Commission data. Eurostatâ€™s main role is to process and publish comparable statistical information at the **European level**. 

Since the amount of data in the Eurostat database is huge, in our first study we are only going to focus on data relative to indicators of educational funding by the member states. 

It can also be downloaded as unprocessed tabular data from the Eurostat database site [Eurostat database site]( http://ec.europa.eu/eurostat/data/database) following the path:  `Tables by themes > Population and social conditions > Education and training > Education > Indicators on education finance > Public expenditure on education`

## Reading tabular data

The way to read CSV files in Pandas is by calling the `read_csv` method. Besides the name of the file, we add the *na_values* key argument to this method along with the character that represents "non available data" in the file. Normally, CSV files have a header with the names of the columns. If this is the case,  we can use the *usecols* parameter to select which columns in the file will be used.

In [73]:
edu = pd.read_csv('files/educ_figdp_1_Data.csv', na_values=':', usecols=['TIME', 'GEO', 'Value'])
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

Beside this, Pandas also has functions for reading files with formats such as Excel, HDF5, tabulated files, json files or even the content from the clipboard (`read_excel(), read_hdf(), read_table(), read_json(), read_clipboard()`). Whichever function we use, the result of reading a file is stored as a DataFrame structure.

## Viewing Data

To see how the data looks, we can use the `head()` method, which shows just the first five rows. if we put a number as an argument to this method, this will be the number of the first rows that are listed.

In [74]:
edu.head()
#edu[0:5]   # Same as edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

Similarly, it exists the **tail()** method, which returns the last five rows by default.

In [75]:
edu.tail()
#edu[-5:]   # Same as edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

If we want to know the names of the columns or the names of the indexes, we can use the DataFrame attributes **columns** and **index** respectively. The names of the columns or indexes can be changed by assigning a new list of the same length to these attributes.

In [78]:
edu.columns

Index(['TIME', 'GEO', 'Value'], dtype='object')

In [79]:
edu.index

RangeIndex(start=0, stop=384, step=1)

The values of any DataFrame can be retrieved as a Python array by calling its **values ** attribute.

In [82]:
edu.values

array([[2000, 'European Union (28 countries)', nan],
       [2001, 'European Union (28 countries)', nan],
       [2002, 'European Union (28 countries)', 5.0],
       ...,
       [2009, 'Finland', 6.81],
       [2010, 'Finland', 6.85],
       [2011, 'Finland', 6.76]], dtype=object)

If we just want quick statistical information on all the numeric columns in a data frame, we can use the function **describe()**. The result shows the count, the mean, the standard deviation, the minimum and maximum, and the percentiles, by default, the 25th, 50th, and 75th, for all the values in each column or series.

In [84]:
edu.describe()

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

## Rows/ Columns Selection

If we want to select a subset of data from a DataFrame, it is necessary to indicate this subset using square brackets **[]** after the DataFrame. The subset can be specified in several ways. If we want to select only one column from a DataFrame, we only need to put its name between the square brackets. The result will be a Series data structure, not a DataFrame, because only one column is retrieved.

In [85]:
edu['Value'].head()

0     NaN
1     NaN
2    5.00
3    5.03
4    4.95
Name: Value, dtype: float64

If we want to select a subset of rows from a DataFrame, we can do so by indicating a range of rows separated by **:** inside the square brackets. This is commonly known as a *slice* of rows.

Next instruction returns the slice of rows from the 10th to the 13th position. Note that the slice does not use the index labels as references, but the position. In this case, the labels of the rows simply coincide with the position of the rows.

In [86]:
edu[10:14]

    TIME                            GEO  Value
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99

 If we want to select a subset of columns and rows using the labels as our references instead of the positions, we can use **loc** and **iloc** for indexing:

In [94]:
#edu.ix[90:94, ['TIME', 'GEO']]

#edu.loc[90:94, ['TIME', 'GEO']]
#edu.iloc[90:94]
edu.iloc[90:94]

    TIME      GEO  Value
90  2006  Belgium   5.98
91  2007  Belgium   6.00
92  2008  Belgium   6.43
93  2009  Belgium   6.57

## Filtering Data

Another way to select a subset of data is by applying Boolean indexing. This indexing is commonly known as a *filter*. For instance, if we want to filter those values less than or equal to 6.5, we can do it like this:

In [96]:
edu[edu['Value'] <= 6.5].tail()

     TIME      GEO  Value
376  2004  Finland   6.42
377  2005  Finland   6.30
378  2006  Finland   6.18
379  2007  Finland   5.90
380  2008  Finland   6.10

## Filtering Missing Values

Pandas uses the special value **NaN** (not a number) to represent missing values. In Python, `NaN` is a special floating-point value returned by certain operations when one of their results ends in an undefined value. A subtle feature of `NaN` values is that two `NaN` are never equal.

In [97]:
if float('NaN') == float('NaN'):
    print("Equal")
else:
    print("Not Equal")

Not Equal

Because of this, the only safe way to tell whether or not a value is missing in a DataFrame is by using the `isnull()` function. Indeed, this function can be used to filter rows with missing values:

In [102]:
edu[edu['Value'].isnull()].head()

    TIME                            GEO  Value
0   2000  European Union (28 countries)    NaN
1   2001  European Union (28 countries)    NaN
36  2000       Euro area (18 countries)    NaN
37  2001       Euro area (18 countries)    NaN
48  2000       Euro area (17 countries)    NaN

## Manipulating Data

Once we know how to select the desired data, the next thing we need to know is how to manipulate data. 
One of the most straightforward things we can do is to operate with columns or rows  using aggregation functions. The following list shows the most common aggregation functions.

| Function  | Description | 
|-----------|-------------|
| count()   |Number of non-null observations|  
| sum()     |Sum of values|
| mean()    |Mean of values            | 
| median()  |Arithmetic median of values             |
| min()     |Minimum|
| max()     |Maximum|
| prod()    |Product of values|
| std()     |Unbiased standard deviation|
| var()     | Unbiased variance|

The result of all these functions applied to a row or column is always a number. 

You can specify if the function should be applied to the rows for each column  (putting the **axis=0** keyword on the invocation of the function), or it should be applied on the columns for each row (putting the **axis=1** keyword on the invocation of the function).

In [105]:
edu.max(axis=0)

TIME      2011
GEO      Spain
Value     8.81
dtype: object


Note that these are functions specific to Pandas, not the generic Python functions. There are differences in their implementation. In Python ,`NaN` values propagate through all operations without raising an exception. In contrast, Pandas operations exclude `NaN` values representing missing data. For example, the pandas **max** function excludes `NaN`  values, thus they are interpreted as missing values, while the standard Python **max** function will take the mathematical interpretation of `NaN` and return it as the maximum:

In [109]:
print ('Pandas max function:', edu['Value'].max())
print ('Python max function:', min(edu['Value']))
print ('Python max function:', np.max(edu['Value']))

Pandas max function: 8.81
Python max function: nan
Python max function: 8.81

Beside these aggregation functions, we can apply operations over all the values in rows, columns or a selection of both. 

For example we can apply any arithmetical operation (+,-,*,/) to an entire row:

In [111]:
s = edu['Value'] / 100
s.head()

0       NaN
1       NaN
2    0.0500
3    0.0503
4    0.0495
Name: Value, dtype: float64

However, we can apply any function to a DataFrame or Series just putting its name as argument  of the **apply** method. For example, in the following code, we apply the  **sqrt** function from the *numpy* library to perform the square root of each value in the *'Value'* column.

In [120]:
s = edu['Value'].apply(np.sqrt)
s.head()

In [138]:
# Self made method
def my_square(a):
    return a*a

In [139]:
s = edu['Value'].apply(my_square)
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

If we need to design a specific function to apply it, we can write an in-line function, commonly known as a $\lambda$-function.

In [140]:
s = edu['Value'].apply(lambda d: d**2)
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

Another basic manipulation operation is to set new values in our DataFrame.

In [151]:
edu['ValueNorm'] = edu['Value'] / edu['Value'].max()
edu.tail()

     TIME      GEO  Value  ValueNorm
380  2008  Finland   6.10   0.692395
381  2009  Finland   6.81   0.772985
382  2010  Finland   6.85   0.777526
383  2011  Finland   6.76   0.767310
384  2000        a   5.00   0.567537

Now, if we  want to remove this column from the DataFrame, we can use the **drop** function; this removes the indicated rows if **axis=0**,  or the indicated columns if **axis=1**. 

In Pandas, all the functions that change the contents of a DataFrame, such as the drop function, will normally return a copy of the modified data, instead of overwriting the DataFrame. Therefore, the original DataFrame is kept. If you do not want to keep the old values, you can set the keyword **inplace** to `True`. By default, this keyword is set to `False`, meaning that a copy of the data is returned.

In [152]:
edu.drop('ValueNorm', axis=1, inplace=False)
edu.head()

   TIME                            GEO  Value  ValueNorm
0  2000  European Union (28 countries)    NaN        NaN
1  2001  European Union (28 countries)    NaN        NaN
2  2002  European Union (28 countries)   5.00   0.567537
3  2003  European Union (28 countries)   5.03   0.570942
4  2004  European Union (28 countries)   4.95   0.561862

Instead, if what we want to do is to insert a new row at the bottom of the DataFrame, we can use the Pandas **append** function. This functions receives as argument the new row, which is represented as a dictionary where the keys are the name of the columns and the values the associated value. You must be aware to setting  the **ignore_index** flag in the **append** method  to `True`, otherwise the index 0 is given to this new row, what will produce an error if it already exists:

In [165]:
edu = edu.append({'TIME': 2000, 'Value': 5.00, 'GEO': 'a'}, ignore_index=True)
edu.tail()

     TIME      GEO  Value  ValueNorm
382  2010  Finland   6.85   0.777526
383  2011  Finland   6.76   0.767310
384  2000        a   5.00        NaN
385  2000        a   5.00        NaN
386  2000        a   5.00        NaN

Finally, if we want to remove this row, we need to use the **drop** function again. Now we have to set the axis to 0, and specify the index of the row we want to remove. Since we want to remove the last row, we can use the max function over the indexes to determine which row is.

In [167]:
#edu.drop(max(edu.index), axis=0, inplace=True)
edu.drop(edu.loc[edu['GEO'] == 'a'].index, axis=0, inplace=True)
edu.tail()
#edu.head()

     TIME      GEO  Value  ValueNorm
379  2007  Finland   5.90   0.669694
380  2008  Finland   6.10   0.692395
381  2009  Finland   6.81   0.772985
382  2010  Finland   6.85   0.777526
383  2011  Finland   6.76   0.767310

 The **drop()** function is also used to remove missing values by applying it over the result of the **isnull()** function. This has a similar effect to filtering the `NaN` values, as we explained above, but here the difference is that a copy of the DataFrame without the `NaN` values is returned, instead of a view.

In [170]:
#print(edu['Value'].isnull().index)
#print(edu['Value'].isnull())

#print(edu['Value'].head().isnull().index)
#print(edu['Value'].head().isnull())

edu_drop = edu.drop(edu[edu['Value'].isnull()].index, axis=0)
#edu.drop(edu[edu['Value'].isnull()].index, axis=0, inplace=True)
#edu_drop.head()
edu_drop.shape

(361, 4)

To remove `NaN` values, instead of the generic drop function, we can use the specific **dropna()** function. If we want to erase any row that contains an `NaN` value, we have to set the **how** keyword to *any*. To restrict it to a subset of columns, we can specify it using the **subset** keyword. As we can see below, the result will we the same as using the **drop** function:

In [172]:
edu_drop = edu.dropna(how='any', subset=['Value'], axis=0)
#edu_drop = edu.dropna(how='any', subset=['Value', 'GEO'], axis=0)
#edu_drop = edu.dropna(how='all', subset=['Value', 'GEO'], axis=0)

print(edu_drop.shape)
edu_drop.head()

(361, 4)

   TIME                            GEO  Value  ValueNorm
2  2002  European Union (28 countries)   5.00   0.567537
3  2003  European Union (28 countries)   5.03   0.570942
4  2004  European Union (28 countries)   4.95   0.561862
5  2005  European Union (28 countries)   4.92   0.558456
6  2006  European Union (28 countries)   4.91   0.557321

If, instead of removing the rows containing `NaN`, we want to fill them with another value, then we can use the **fillna()** method, specifying which value has to be used. If we want to fill only some specific columns, we have to put as argument to the **fillna()** function a dictionary with the name of the columns as the key and which character to be used for filling as the value.

In [174]:
eduFilled = edu.fillna(value={'Value': 0})
eduFilled.head()

   TIME                            GEO  Value  ValueNorm
0  2000  European Union (28 countries)   0.00        NaN
1  2001  European Union (28 countries)   0.00        NaN
2  2002  European Union (28 countries)   5.00   0.567537
3  2003  European Union (28 countries)   5.03   0.570942
4  2004  European Union (28 countries)   4.95   0.561862

## Sorting

Another important functionality we will need when inspecting our data is to sort by columns. We can sort a DataFrame using any column, using the **sort_values** function.  If we want to see the first five rows of data sorted in descending order  (i.e., from the largest to the smallest values) and using the *'Value'* column, then we just need to do this:

In [43]:
#edu.sort_values(by='Value', inplace=True)
#edu.sort_values(by='Value', ascending=False, inplace=True)
edu.sort_values(by=['GEO', 'Value'], ascending=False, inplace=True)
edu.head()

     TIME    GEO  Value  ValueNorm
189  2009  Spain   5.02   0.569807
190  2010  Spain   4.98   0.565267
191  2011  Spain   4.82   0.547106
188  2008  Spain   4.62   0.524404
187  2007  Spain   4.34   0.492622

Note that the **inplace** keyword means that the DataFrame will be overwritten, and hence no new DataFrame is returned. If instead of **ascending = False** we use **ascending = True**, the values are sorted in ascending order (i.e. from the smallest to the largest values).

If we want to return to the original order, we can sort by an index using the **sort_index** function and specifying **axis=0**:

In [44]:
edu.sort_index(axis=0, ascending=True, inplace=True)
edu.head()

   TIME                            GEO  Value  ValueNorm
0  2000  European Union (28 countries)    NaN        NaN
1  2001  European Union (28 countries)    NaN        NaN
2  2002  European Union (28 countries)   5.00   0.567537
3  2003  European Union (28 countries)   5.03   0.570942
4  2004  European Union (28 countries)   4.95   0.561862

## Grouping Data

Another very useful way to inspect data is to group it according to some criteria. For instance, in our example it would be nice to group all the data by country, regardless of the year. 

Pandas has the **groupby** function that allows us to do just that. 

For example, in our case, if we want a DataFrame showing the mean of the values for each country over all the years, we can obtain it by grouping according to country and using the mean function as the aggregation method for each group. The result would be  a DataFrame with countries as indexes and the mean values as the column:

In [45]:
group = edu[['GEO', 'Value']].groupby('GEO').mean()
group.head()

                   Value
GEO
Austria         5.618333
Belgium         6.189091
Bulgaria        4.093333
Cyprus          7.023333
Czech Republic  4.168333

In [46]:
#Change type of value column
edu.astype({'Value': 'float64'})
edu.dtypes

TIME           int64
GEO           object
Value        float64
ValueNorm    float64
dtype: object

## Rearranging Data

Up until now, our indexes have been just a numeration of rows without much meaning.  We can transform the arrangement of our data, redistributing the indexes and columns for better manipulation of our data, which normally leads to better performance. We can rearrange our data using the **pivot_table** function. Here, we can specify which columns will be the new indexes, the new values and the new columns. 

For example, imagine that we want to transform our DataFrame to a spreadsheet-like structure with the country names as the index, while the columns will be the years starting from 2006 and the values will be the previous *'Value'* column. To do this, first we need to filter out the data and then pivot it in this way:

In [54]:
filtered_data = edu[edu['TIME'] > 2005]
pivedu = pd.pivot_table(filtered_data, values='Value', index=['GEO'], columns=['TIME'])
pivedu.head()

TIME            2006  2007  2008  2009  2010  2011
GEO
Austria         5.40  5.33  5.47  5.98  5.91  5.80
Belgium         5.98  6.00  6.43  6.57  6.58  6.55
Bulgaria        4.04  3.88  4.44  4.58  4.10  3.82
Cyprus          7.02  6.95  7.45  7.98  7.92  7.87
Czech Republic  4.42  4.05  3.92  4.36  4.25  4.51

Now we can use the new index to select specific rows by label, using the **loc** operator:

In [59]:
#pivedu.ix[['Spain', 'Portugal'], [2006, 2011]]
pivedu.loc[['Spain', 'Portugal'], [2006, 2011]]

TIME      2006  2011
GEO
Spain     4.26  4.82
Portugal  5.07  5.27

## Ranking Data

Another useful visualization feature is to rank data. For example, we would like to know how  each country is ranked by year. To see this, we will use the pandas **rank** function. 
Note here that the parameter `ascending=False` makes the ranking go from the highest values to the lowest values. 

#### The Pandas rank function supports different tie-breaking methods, specified with the **method** parameter. 
* average: average rank of the group (Also Default)
* min: lowest rank in the group
* max: highest rank in the group
* first: ranks assigned in order they appear in the array
* dense: like â€˜minâ€™, but rank always increases by 1 between groups

In [66]:
pivedu = pivedu.dropna()
pivedu.rank(ascending=False, method='first').head()
#pivedu.rank(ascending=True, method='average').head()
#pivedu.rank(ascending=True, method='min').head()
#pivedu.rank(ascending=True, method='max').head()
#pivedu.rank(ascending=True, method='dense').head()

TIME            2006  2007  2008  2009  2010  2011
GEO
Austria         10.0   7.0  11.0   7.0   8.0   8.0
Belgium          5.0   4.0   3.0   4.0   5.0   5.0
Bulgaria        28.0  28.0  27.0  27.0  29.0  29.0
Cyprus           2.0   2.0   2.0   2.0   2.0   3.0
Czech Republic  26.0  27.0  28.0  28.0  27.0  26.0

In [67]:

#print(pivedu.columns)
#print(pivedu.columns.name)

#print(pivedu.index)
#print(pivedu.index.name)

#df22 = edu.rename(columns = {'GEO': 'Geography'}, inplace = False)
#df22.head()

In [68]:
pivedu[:2]

TIME     2006  2007  2008  2009  2010  2011
GEO
Austria  5.40  5.33  5.47  5.98  5.91  5.80
Belgium  5.98  6.00  6.43  6.57  6.58  6.55

If we want to make a global ranking taking into account all the years, we can sum up all the columns and rank the result. Then we can sort the resulting values to retrieve the top 5 countries for the last 6 years, in this way:

In [69]:

totalSum = pivedu.sum(axis=1)
totalSum.head()
#arr = np.array([[1,2,3],[1,2,3]])
#print(arr)
#np.sum(arr, axis=1)

GEO
Austria           33.89
Belgium           38.11
Bulgaria          24.86
Cyprus            45.19
Czech Republic    25.51
dtype: float64

In [70]:

totalSum = pivedu.sum(axis=1)
totalSum.rank(ascending=False, method='first').sort_values().head()
#totalSum.rank(ascending=False, method='first').sort_values().tail()

GEO
Denmark    1.0
Cyprus     2.0
Finland    3.0
Malta      4.0
Belgium    5.0
dtype: float64